// Найти экстремум функции F(X) одним из четырех методов (методом золотого сечения, методом ломаных, методом касательных, методом Ньютона). 
// Желательно запрограммировать на любом языке программирования или в Матлаб.
// 22 2x^2-12x min [0; 2] 0.01

#include <iostream>

int main()
{
    std::cout << "Hello World!\n";
}